#### [`repos`] Terraform Plan 📖`success`



<details><summary>Show Plan</summary>

```tf
github_repository.cdktn-provider-databricks_repo_E79BCECF: Preparing import... [id=cdktn-provider-databricks]
data.github_team.cdktn-team-cdk-terrain: Reading...
data.github_team.cdktn-team-cdk-terrain: Read complete after 8s [id=15746607]
github_repository.cdktn-provider-databricks-go_repo_19A074C5: Preparing import... [id=cdktn-provider-databricks-go]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_actions_secret.cdktn-provider-databricks_repo_secret-alert-prs-slack-webhook-url_1FDA742A will be created
  + resource "github_actions_secret" "cdktn-provider-databricks_repo_secret-alert-prs-slack-webhook-url_1FDA742A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-databricks"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-databricks_repo_secret-gh-app-id-alias-PROJEN_APP_ID_683EBB2D will be created
  + resource "github_actions_secret" "cdktn-provider-databricks_repo_secret-gh-app-id-alias-PROJEN_APP_ID_683EBB2D" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-databricks"
      + secret_name     = "PROJEN_APP_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-databricks_repo_secret-gh-app-id_8ED187A2 will be created
  + resource "github_actions_secret" "cdktn-provider-databricks_repo_secret-gh-app-id_8ED187A2" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-databricks"
      + secret_name     = "GH_APP_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-databricks_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_62A242B4 will be created
  + resource "github_actions_secret" "cdktn-provider-databricks_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_62A242B4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-databricks"
      + secret_name     = "PROJEN_APP_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-databricks_repo_secret-gh-app-private-key_2BB4DA8C will be created
  + resource "github_actions_secret" "cdktn-provider-databricks_repo_secret-gh-app-private-key_2BB4DA8C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-databricks"
      + secret_name     = "GH_APP_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-databricks_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_E143B310 will be created
  + resource "github_actions_secret" "cdktn-provider-databricks_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_E143B310" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-databricks"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-databricks_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_FFBB0ECB will be created
  + resource "github_actions_secret" "cdktn-provider-databricks_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_FFBB0ECB" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-databricks"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-databricks_repo_secret-gh-token_56B39598 will be created
  + resource "github_actions_secret" "cdktn-provider-databricks_repo_secret-gh-token_56B39598" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-databricks"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-databricks_repo_secret-npm-token_2265B02E will be created
  + resource "github_actions_secret" "cdktn-provider-databricks_repo_secret-npm-token_2265B02E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-databricks"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-databricks_repo_secret-twine-password_D8A1524C will be created
  + resource "github_actions_secret" "cdktn-provider-databricks_repo_secret-twine-password_D8A1524C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-databricks"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-databricks_repo_secret-twine-username_ED68300D will be created
  + resource "github_actions_secret" "cdktn-provider-databricks_repo_secret-twine-username_ED68300D" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-databricks"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_branch_protection.cdktn-provider-databricks_repository-setup_main-protection_8DB89E8C will be created
  + resource "github_branch_protection" "cdktn-provider-databricks_repository-setup_main-protection_8DB89E8C" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "cdktn-provider-databricks"
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "Validate PR title",
              + "build",
              + "package-go",
              + "package-js",
              + "package-python",
            ]
          + strict   = false
        }
    }

  # github_issue_label.cdktn-provider-databricks-go_repository-setup_auto-approve-label_42E77F32 will be created
  + resource "github_issue_label" "cdktn-provider-databricks-go_repository-setup_auto-approve-label_42E77F32" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktn-provider-databricks-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-databricks-go_repository-setup_automerge-label_992D9C6A will be created
  + resource "github_issue_label" "cdktn-provider-databricks-go_repository-setup_automerge-label_992D9C6A" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktn-provider-databricks-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-databricks-go_repository-setup_no-auto-close-label_B572ABD5 will be created
  + resource "github_issue_label" "cdktn-provider-databricks-go_repository-setup_no-auto-close-label_B572ABD5" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktn-provider-databricks-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-databricks_repository-setup_auto-approve-label_63FECC2D will be created
  + resource "github_issue_label" "cdktn-provider-databricks_repository-setup_auto-approve-label_63FECC2D" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktn-provider-databricks"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-databricks_repository-setup_automerge-label_A5F65AD4 will be created
  + resource "github_issue_label" "cdktn-provider-databricks_repository-setup_automerge-label_A5F65AD4" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktn-provider-databricks"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-databricks_repository-setup_no-auto-close-label_56273D22 will be created
  + resource "github_issue_label" "cdktn-provider-databricks_repository-setup_no-auto-close-label_56273D22" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktn-provider-databricks"
      + url        = (known after apply)
    }

  # github_repository.cdktn-provider-databricks-go_repo_19A074C5 will be updated in-place
  # (imported from "cdktn-provider-databricks-go")
  ~ resource "github_repository" "cdktn-provider-databricks-go_repo_19A074C5" {
      ~ allow_auto_merge            = false -> true
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
      ~ allow_update_branch         = false -> true
      + archive_on_destroy          = true
        archived                    = false
      ~ auto_init                   = false -> true
        default_branch              = "main"
      ~ delete_branch_on_merge      = false -> true
      + description                 = "CDK Terrain Go provider bindings for databricks."
        etag                        = "W/\"9183b92fae53659834cf3f260f6b3e2548a456e02aaaf564109f5aa3eb31264d\""
        full_name                   = "cdktn-io/cdktn-provider-databricks-go"
        git_clone_url               = "git://github.com/cdktn-io/cdktn-provider-databricks-go.git"
        has_discussions             = false
      - has_downloads               = true -> null
      ~ has_issues                  = true -> false
      ~ has_projects                = true -> false
      ~ has_wiki                    = true -> false
      + homepage_url                = "https://cdktn.io"
        html_url                    = "https://github.com/cdktn-io/cdktn-provider-databricks-go"
        http_clone_url              = "https://github.com/cdktn-io/cdktn-provider-databricks-go.git"
        id                          = "cdktn-provider-databricks-go"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "cdktn-provider-databricks-go"
        node_id                     = "R_kgDORVdL8w"
        primary_language            = "Go"
        private                     = false
        repo_id                     = 1163348979
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        ssh_clone_url               = "git@github.com:cdktn-io/cdktn-provider-databricks-go.git"
        svn_url                     = "https://github.com/cdktn-io/cdktn-provider-databricks-go"
      ~ topics                      = [
          + "cdk",
          + "cdk-terrain",
          + "cdktf",
          + "cdktn",
          + "databricks",
          + "opentofu",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
        visibility                  = "public"
      ~ vulnerability_alerts        = true -> false
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository.cdktn-provider-databricks_repo_E79BCECF will be updated in-place
  # (imported from "cdktn-provider-databricks")
  ~ resource "github_repository" "cdktn-provider-databricks_repo_E79BCECF" {
      ~ allow_auto_merge            = false -> true
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
      ~ allow_update_branch         = false -> true
      + archive_on_destroy          = true
        archived                    = false
      ~ auto_init                   = false -> true
        default_branch              = "main"
      ~ delete_branch_on_merge      = false -> true
      + description                 = "Prebuilt CDK Terrain (cdktn) provider for databricks."
        etag                        = "W/\"d6a86565ddc8342b34334beeb4092a31b007dc65d7ab933f32948e073d2c9309\""
        full_name                   = "cdktn-io/cdktn-provider-databricks"
        git_clone_url               = "git://github.com/cdktn-io/cdktn-provider-databricks.git"
        has_discussions             = false
      - has_downloads               = true -> null
        has_issues                  = true
      ~ has_projects                = true -> false
      ~ has_wiki                    = true -> false
      + homepage_url                = "https://cdktn.io"
        html_url                    = "https://github.com/cdktn-io/cdktn-provider-databricks"
        http_clone_url              = "https://github.com/cdktn-io/cdktn-provider-databricks.git"
        id                          = "cdktn-provider-databricks"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "cdktn-provider-databricks"
        node_id                     = "R_kgDORVdLCw"
        primary_language            = "TypeScript"
        private                     = false
        repo_id                     = 1163348747
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        ssh_clone_url               = "git@github.com:cdktn-io/cdktn-provider-databricks.git"
        svn_url                     = "https://github.com/cdktn-io/cdktn-provider-databricks"
      ~ topics                      = [
          + "cdk",
          + "cdk-terrain",
          + "cdktf",
          + "cdktn",
          + "databricks",
          + "opentofu",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository_dependabot_security_updates.cdktn-provider-databricks_dependabot-security_73013DE7 will be created
  + resource "github_repository_dependabot_security_updates" "cdktn-provider-databricks_dependabot-security_73013DE7" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "cdktn-provider-databricks"
    }

  # github_repository_webhook.cdktn-provider-databricks-go_repository-setup_slack-webhook_42869C4F will be created
  + resource "github_repository_webhook" "cdktn-provider-databricks-go_repository-setup_slack-webhook_42869C4F" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktn-provider-databricks-go"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.cdktn-provider-databricks_repository-setup_slack-webhook_DF181C1C will be created
  + resource "github_repository_webhook" "cdktn-provider-databricks_repository-setup_slack-webhook_DF181C1C" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktn-provider-databricks"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_team_repository.cdktn-provider-databricks-go_repository-setup_managing-team_F9F70C15 will be created
  + resource "github_team_repository" "cdktn-provider-databricks-go_repository-setup_managing-team_F9F70C15" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktn-provider-databricks-go"
      + team_id    = "15746607"
    }

  # github_team_repository.cdktn-provider-databricks_repository-setup_managing-team_BFB8D2C3 will be created
  + resource "github_team_repository" "cdktn-provider-databricks_repository-setup_managing-team_BFB8D2C3" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktn-provider-databricks"
      + team_id    = "15746607"
    }

Plan: 2 to import, 23 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ providerRepos   = [
        # (6 unchanged elements hidden)
        "github_repository.cdktn-provider-cloudinit_repo_8DDE9C9A.ssh_clone_url",
      + "github_repository.cdktn-provider-databricks_repo_E79BCECF.ssh_clone_url",
        "github_repository.cdktn-provider-datadog_repo_5981A3A2.ssh_clone_url",
        # (17 unchanged elements hidden)
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @team-cdk-terrain[bot], Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*